In [75]:
!pip install scikit-learn

Requirement already satisfied: scikit-learn in c:\users\rohit\anaconda3\lib\site-packages (1.0.2)
Requirement already satisfied: scipy>=1.1.0 in c:\users\rohit\anaconda3\lib\site-packages (from scikit-learn) (1.7.3)
Requirement already satisfied: threadpoolctl>=2.0.0 in c:\users\rohit\anaconda3\lib\site-packages (from scikit-learn) (2.2.0)
Requirement already satisfied: joblib>=0.11 in c:\users\rohit\anaconda3\lib\site-packages (from scikit-learn) (1.1.0)
Requirement already satisfied: numpy>=1.14.6 in c:\users\rohit\anaconda3\lib\site-packages (from scikit-learn) (1.21.5)

In [76]:
import pandas as pd

In [77]:
df = pd.read_excel("F:\DATA SCIENCE\practice\datasets\Titanic.xlsx")
df.head()

,PassengerId,Name,Pclass,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked,Survived
0,1,"Braund, Mr. Owen Harris",3,male,22.0,1,0,A/5 21171,7.2500,NaN,S,0
1,2,"Cumings, Mrs. John Bradley (Florence Briggs Th...",1,female,38.0,1,0,PC 17599,71.2833,C85,C,1
2,3,"Heikkinen, Miss. Laina",3,female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S,1
3,4,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",1,female,35.0,1,0,113803,53.1000,C123,S,1
4,5,"Allen, Mr. William Henry",3,male,35.0,0,0,373450,8.0500,NaN,S,0

In [78]:
df.drop(["PassengerId","Name","SibSp","Parch","Ticket","Fare","Cabin"],axis = 1, inplace = True)

In [79]:
df.describe()

           Pclass         Age    Survived
count  891.000000  714.000000  891.000000
mean     2.308642   29.699118    0.383838
std      0.836071   14.526497    0.486592
min      1.000000    0.420000    0.000000
25%      2.000000   20.125000    0.000000
50%      3.000000   28.000000    0.000000
75%      3.000000   38.000000    1.000000
max      3.000000   80.000000    1.000000

In [80]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 891 entries, 0 to 890
Data columns (total 5 columns):
 #   Column    Non-Null Count  Dtype
---  ------    --------------  -----
 0   Pclass    891 non-null    int64
 1   Sex       891 non-null    object
 2   Age       714 non-null    float64
 3   Embarked  889 non-null    object
 4   Survived  891 non-null    int64
dtypes: float64(1), int64(2), object(2)
memory usage: 34.9+ KB

In [81]:
df.isnull().sum()

Pclass        0
Sex           0
Age         177
Embarked      2
Survived      0
dtype: int64

In [82]:
df.dropna(subset=["Embarked"],inplace = True)

In [83]:
df.isnull().sum()

Pclass        0
Sex           0
Age         177
Embarked      0
Survived      0
dtype: int64

In [84]:
x=df["Age"].mean()
round(x)

30

In [85]:
df["Age"] = df["Age"].fillna(round(x))

In [87]:
df.isnull().sum()

Pclass      0
Sex         0
Age         0
Embarked    0
Survived    0
dtype: int64

In [88]:
final = pd.get_dummies(data = df, columns = ["Sex","Embarked"], drop_first = True)
final.head()

   Pclass   Age  Survived  Sex_male  Embarked_Q  Embarked_S
0       3  22.0         0         1           0           1
1       1  38.0         1         0           0           0
2       3  26.0         1         0           0           1
3       1  35.0         1         0           0           1
4       3  35.0         0         1           0           1

In [89]:
final.isnull().sum()

Pclass        0
Age           0
Survived      0
Sex_male      0
Embarked_Q    0
Embarked_S    0
dtype: int64

In [90]:
X = final.drop("Survived", axis = 1) 
y= final.Survived

In [91]:
from sklearn.model_selection import train_test_split

In [92]:
X_train, X_test, y_train, y_test = train_test_split(X, y, test_size=0.20, random_state=42)

In [93]:
X_train.shape

(711, 5)

In [94]:
X_test.shape

(178, 5)

In [95]:
df.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 889 entries, 0 to 890
Data columns (total 5 columns):
 #   Column    Non-Null Count  Dtype
---  ------    --------------  -----
 0   Pclass    889 non-null    int64
 1   Sex       889 non-null    object
 2   Age       889 non-null    float64
 3   Embarked  889 non-null    object
 4   Survived  889 non-null    int64
dtypes: float64(1), int64(2), object(2)
memory usage: 41.7+ KB

In [96]:
from sklearn.naive_bayes import BernoulliNB

In [97]:
model = BernoulliNB()

In [98]:
model.fit(X_train , y_train)

BernoulliNB()

In [102]:
model.score(X_test, y_test)

0.797752808988764

In [99]:
from sklearn.naive_bayes import GaussianNB

In [100]:
model1 = GaussianNB()

In [105]:
model1.fit(X_train, y_train)

GaussianNB()

In [106]:
model1.score(X_test, y_test)

0.7808988764044944

In [107]:
from sklearn.naive_bayes import MultinomialNB
model2 = MultinomialNB()
model2.fit(X_train, y_train)
model2.score(X_test, y_test)

0.7078651685393258